Revit 2027 API
DesignToFabricationConverter.GetElementsWithOpenConnector Method
 Gets the set of fabrication part or MEP design element identifiers with open connectors, caused by fittings failing to convert.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetElementsWithOpenConnector()
Public Function GetElementsWithOpenConnector As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetElementsWithOpenConnector()
member GetElementsWithOpenConnector : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
Remarks
 This set of element identifiers is only available after the Convert method has been invoked, and returns DesignToFabricationConverterResult::Enum::PartialFailure.
See Also
Reference
DesignToFabricationConverter Class
Autodesk.Revit.DB.Fabrication Namespace